results/out/aleph.ring-interceptors.sync.java17.ShenandoahGC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 6.252ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.737ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.093ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.640ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.377ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.815ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.274ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.880ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.941ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.878ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.763ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 1.829ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.914ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.470ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 5.458ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.378ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.83ms    3.66ms  47.58ms   73.57%
    Req/Sec   643.78    523.46     2.78k    71.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.68ms
 75.000%    7.03ms
 90.000%   10.20ms
 99.000%   15.49ms
 99.900%   21.65ms
 99.990%   27.81ms
 99.999%   35.13ms
100.000%   47.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.092     0.000000            1         1.00
       1.202     0.100000       590965         1.11
       1.665     0.200000      1179830         1.25
       2.231     0.300000      1769810         1.43
       2.917     0.400000      2359587         1.67
       3.677     0.500000      2950746         2.00
       4.115     0.550000      3245596         2.22
       4.695     0.600000      3539983         2.50
       5.419     0.650000      3835730         2.86
       6.199     0.700000      4129270         3.33
       7.031     0.750000      4425239         4.00
       7.463     0.775000      4571897         4.44
       7.923     0.800000      4720213         5.00
       8.415     0.825000      4868320         5.71
       8.951     0.850000      5015899         6.67
       9.535     0.875000      5162095         8.00
       9.855     0.887500      5236026         8.89
      10.199     0.900000      5309592        10.00
      10.575     0.912500      5382993        11.43
      10.991     0.925000      5456510        13.33
      11.455     0.937500      5531110        16.00
      11.703     0.943750      5567689        17.78
      11.967     0.950000      5604015        20.00
      12.279     0.956250      5641558        22.86
      12.631     0.962500      5677954        26.67
      13.039     0.968750      5714589        32.00
      13.271     0.971875      5732850        35.56
      13.535     0.975000      5751689        40.00
      13.823     0.978125      5769803        45.71
      14.159     0.981250      5788394        53.33
      14.543     0.984375      5806715        64.00
      14.767     0.985938      5816052        71.11
      15.015     0.987500      5825122        80.00
      15.295     0.989062      5834310        91.43
      15.623     0.990625      5843537       106.67
      16.039     0.992188      5852689       128.00
      16.319     0.992969      5857307       142.22
      16.687     0.993750      5861974       160.00
      17.135     0.994531      5866554       182.86
      17.695     0.995313      5871220       213.33
      18.335     0.996094      5875775       256.00
      18.703     0.996484      5878062       284.44
      19.071     0.996875      5880329       320.00
      19.455     0.997266      5882666       365.71
      19.823     0.997656      5884990       426.67
      20.207     0.998047      5887257       512.00
      20.431     0.998242      5888444       568.89
      20.671     0.998437      5889561       640.00
      20.943     0.998633      5890704       731.43
      21.279     0.998828      5891835       853.33
      21.695     0.999023      5893002      1024.00
      21.951     0.999121      5893563      1137.78
      22.223     0.999219      5894146      1280.00
      22.543     0.999316      5894725      1462.86
      22.879     0.999414      5895308      1706.67
      23.215     0.999512      5895872      2048.00
      23.407     0.999561      5896160      2275.56
      23.615     0.999609      5896463      2560.00
      23.807     0.999658      5896740      2925.71
      24.047     0.999707      5897020      3413.33
      24.479     0.999756      5897313      4096.00
      24.751     0.999780      5897455      4551.11
      25.087     0.999805      5897600      5120.00
      25.503     0.999829      5897739      5851.43
      26.095     0.999854      5897885      6826.67
      26.959     0.999878      5898028      8192.00
      27.407     0.999890      5898099      9102.22
      27.903     0.999902      5898176     10240.00
      28.399     0.999915      5898243     11702.86
      29.231     0.999927      5898318     13653.33
      30.031     0.999939      5898391     16384.00
      30.479     0.999945      5898424     18204.44
      30.975     0.999951      5898459     20480.00
      31.439     0.999957      5898498     23405.71
      31.855     0.999963      5898533     27306.67
      32.415     0.999969      5898568     32768.00
      32.687     0.999973      5898585     36408.89
      33.119     0.999976      5898603     40960.00
      33.535     0.999979      5898623     46811.43
      33.919     0.999982      5898640     54613.33
      34.239     0.999985      5898658     65536.00
      34.495     0.999986      5898666     72817.78
      34.815     0.999988      5898675     81920.00
      35.071     0.999989      5898686     93622.86
      35.135     0.999991      5898693    109226.67
      35.615     0.999992      5898702    131072.00
      35.775     0.999993      5898708    145635.56
      36.127     0.999994      5898712    163840.00
      36.671     0.999995      5898716    187245.71
      37.311     0.999995      5898720    218453.33
      40.735     0.999996      5898725    262144.00
      41.791     0.999997      5898727    291271.11
      42.111     0.999997      5898729    327680.00
      42.591     0.999997      5898732    374491.43
      43.711     0.999998      5898734    436906.67
      44.511     0.999998      5898736    524288.00
      44.543     0.999998      5898737    582542.22
      45.055     0.999998      5898738    655360.00
      45.535     0.999999      5898740    748982.86
      45.599     0.999999      5898741    873813.33
      45.759     0.999999      5898742   1048576.00
      45.759     0.999999      5898742   1165084.44
      45.791     0.999999      5898743   1310720.00
      46.271     0.999999      5898744   1497965.71
      46.271     0.999999      5898744   1747626.67
      46.879     1.000000      5898745   2097152.00
      46.879     1.000000      5898745   2330168.89
      46.879     1.000000      5898745   2621440.00
      47.551     1.000000      5898746   2995931.43
      47.551     1.000000      5898746   3495253.33
      47.551     1.000000      5898746   4194304.00
      47.551     1.000000      5898746   4660337.78
      47.551     1.000000      5898746   5242880.00
      47.615     1.000000      5898747   5991862.86
      47.615     1.000000      5898747          inf
#[Mean    =        4.834, StdDeviation   =        3.664]
#[Max     =       47.584, Total count    =      5898747]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5997597 requests in 10.00m, 1.00GB read
Requests/sec:   9995.95
Transfer/sec:      1.71MB